              02  StudentId     PIC 9(2).
              02  StudentName.
                  03 Surname    PIC X(8).
                  03 Initials   PIC XX.
              02  SecondID      PIC S9(4).
              02  Score         PIC S9(3)V9.
              02  CourseCode    PIC X(4).
              02  Gender        PIC X.
