           01 StudentDetailsLseq.
              88 EndOfFile        VALUE HIGH-VALUES.
              02  StudentIdLseq   PIC 9(2).
              02  StudentNameLseq.
                  03 SurnameLseq  PIC X(8).
                  03 InitialsLseq PIC XX.
              02  SecondIDLseq    PIC S9(4).
              02  ScoreLseq       PIC S9(3)V9.
              02  CourseCodeLseq  PIC X(4).
              02  GenderLseq      PIC X.
