        ord-ws pic 9(3) value 66. 
       display "Character at ordinal position ", 
               ord-ws, " in the". 
       display "program collating sequence is: ", 
               function char(ord-ws).
