        01 RECCPY1.
                05  RACH PIC X(1).
                05  RBSH PIC S9(4) COMP-5.
                05  RCSTR PIC X(40).
                05  RDLO32 PIC S9(9) COMP.
     **@binary=true
                05  RECA PIC X(20).
                05  RFFI PIC X(32000).
