      **=============================================================**
      * Copybook for CHANCONC / CHANCONS
      **=============================================================**
            05  HEAD.
                10  ACH PIC X(1).
                10  BINT PIC S9(9) COMP.
                10  CSTR PIC X(40).
                10  DLO32 PIC S9(9) COMP.
                10  ECA PIC X(20).
            05  APPEND.
                10  FFI PIC X(40000).
