         01  DATAF16-REC.
             03 S-NAME               PIC X(08).
             03 S-ID                 PIC X(04).
             03 S-VALUE              PIC X(04).

